The purpose of this function is to count the values or combination of values in an entire dataset or a subselection of the columns in a dataset. I have created this function because I couldn't find a pandas function that can count both missing and non-missing values while also looking at a combination of values (multiple columns)

In [15]:
from collections import Counter
import pandas as pd
import numpy as np

# doesn't work
def old_tidy_count(df,columns=None):
    
    # Only look at the columns specified
    # look at all columns otherwise
    if columns != None:
        df = df[list(columns)]
    else:
        pass
    
    # Get a unique list of rows and the column names
    all_rows = df.values.tolist()
    #col_names = df.columns.values

    # Unique rows as a list of lists and also a pandas dataframe
    unique_rows_pd = df.drop_duplicates()
    unique_rows = unique_rows_pd.values.tolist()
    print(unique_rows_pd)

    # Find the index for each row
    row_keys = [ unique_rows.index(row) for row in all_rows]

    # Count occurences by index, convert to dictionary
    key_counts = dict(Counter(row_keys))

    # Create a pandas dataframe from the counts dictionary, sort by index
    key_count_ref = pd.DataFrame(index= list(key_counts.keys()),
            data= {'count': list(key_counts.values())}).sort_index()

    # Combine our original rows data with our 
    final_counts = pd.concat([unique_rows_pd,key_count_ref],axis=1).\
        sort_values('count',ascending=False)
    
    return(final_counts)

In [106]:
[str(x) for x in cars.columns.values ]

['name', 'hp', 'color']

In [168]:
import random
import string

# requires numpy, pandas, string
def tidy_count(df):
    na_filler = 'Uf83ljfDZ3'
    
    pds_allvals = pd.Series()
    for col in cars.columns.values:
        pds_allvals = pd.concat([pds_allvals,cars[str(col)]]).drop_duplicates()
    allvals = pds_allvals.tolist()
    
    # Make sure na_filler is not a value in the dataset
    while na_filler in allvals:
        na_filler = ''.join(random.choices(string.digits + string.ascii_letters, k=np.random.randint(3,12)))  
        
    print(na_filler)
    
    return(df.fillna(na_filler).groupby([str(x) for x in df.columns.values]).size().\
             reset_index().rename(columns={0 : 'count'}).\
         replace(na_filler,np.NaN).sort_values('count',ascending=False))

In [169]:
tidy_count(cars)

Uf83ljfDZ3

             name      hp color  count
2            Bike     NaN  blue      2
0       Batmobile   900.0   NaN      1
1       Batmobile  1000.0   NaN      1
3  Toyota Corolla   120.0   red      1

In [122]:
pds_combi = pd.Series()

In [134]:
pds_combi = pd.Series()
#columns = cars.columns.values
#last_col = columns[len(columns)-1]
for col in cars.columns.values:
    pds_combi = pd.concat([pds_combi,cars[str(col)]]).drop_duplicates()

In [136]:
pds_combi.tolist()

['Batmobile',
 'Toyota Corolla',
 'Bike',
 1000.0,
 120.0,
 nan,
 900.0,
 'red',
 'blue']

In [129]:
len(pds_combi.drop_duplicates())

9

In [36]:
import itertools
num = [[10, 20,'cool'], [40,np.nan,'cool'], [40,np.nan,'cool'], [30, 56, 25], [10, 20], [33], [40]]
print("Original List", num)
num.sort()
new_num = list(num for num,_ in itertools.groupby(num))
print("New List", new_num)

Original List [[10, 20, 'cool'], [40, nan, 'cool'], [40, nan, 'cool'], [30, 56, 25], [10, 20], [33], [40]]
New List [[10, 20], [10, 20, 'cool'], [30, 56, 25], [33], [40], [40, nan, 'cool']]

In [37]:
num

[[10, 20],
 [10, 20, 'cool'],
 [30, 56, 25],
 [33],
 [40],
 [40, nan, 'cool'],
 [40, nan, 'cool']]

In [45]:
all_rows = cars.values.tolist()

In [52]:
type(all_rows[0][2])

float

In [39]:
type(all_rows)

list

In [32]:
all_rows.sort()

In [33]:
new_num = list(all_rows for all_rows,_ in itertools.groupby(all_rows))

In [35]:
all_rows

[['Batmobile', 900.0, nan],
 ['Batmobile', 1000.0, nan],
 ['Bike', nan, 'blue'],
 ['Bike', nan, 'blue'],
 ['Bike', 5.0, 'blue'],
 ['Bike', nan, 'blue'],
 ['Toyota Corolla', 120.0, 'red']]

In [34]:
new_num

[['Batmobile', 900.0, nan],
 ['Batmobile', 1000.0, nan],
 ['Bike', nan, 'blue'],
 ['Bike', nan, 'blue'],
 ['Bike', 5.0, 'blue'],
 ['Bike', nan, 'blue'],
 ['Toyota Corolla', 120.0, 'red']]

## Test

In [102]:
car_names = pd.DataFrame({'name' : ['Batmobile','Toyota Corolla','Bike','Bike','Batmobile'],
            'hp': [1000,120,np.nan,np.nan,900]})
car_attr = pd.DataFrame({"name": ["Bike","Toyota Corolla"], "color": ["blue","red"]})
cars = car_names.merge(car_attr,how='left',on='name')

In [96]:
cars

             name      hp color
0       Batmobile  1000.0   NaN
1  Toyota Corolla   120.0   red
2            Bike     NaN  blue
3            Bike     NaN  blue
4       Batmobile   900.0   NaN

In [98]:
cars.groupby(['name','hp','color']).size()

name            hp     color
Toyota Corolla  120.0  red      1
dtype: int64

In [83]:
cars['hp'].value_counts(dropna=False)

NaN        3
 5.0       1
 900.0     1
 120.0     1
 1000.0    1
Name: hp, dtype: int64

In [79]:
cars

             name      hp color
0       Batmobile  1000.0   NaN
1  Toyota Corolla   120.0   red
2            Bike     NaN  blue
3            Bike     NaN  blue
4       Batmobile   900.0   NaN
5            Bike     5.0  blue
6            Bike     NaN  blue

In [80]:
my_rows = cars.values.tolist()
my_rows_dedup = cars.drop_duplicates().values.tolist()

In [81]:
my_rows

[['Batmobile', 1000.0, nan],
 ['Toyota Corolla', 120.0, 'red'],
 ['Bike', nan, 'blue'],
 ['Bike', nan, 'blue'],
 ['Batmobile', 900.0, nan],
 ['Bike', 5.0, 'blue'],
 ['Bike', nan, 'blue']]

In [101]:
my_rows_dedup

[['Batmobile', 1000.0, nan],
 ['Toyota Corolla', 120.0, 'red'],
 ['Bike', nan, 'blue'],
 ['Batmobile', 900.0, nan]]

In [100]:
my_rows = cars.values.tolist()
my_rows_dedup = cars.drop_duplicates().values.tolist()

for x in my_rows:
    print(x)
    print('Row index: ', my_rows.index(x), ' Unique Index: ', my_rows_dedup.index(x))

['Batmobile', 1000.0, nan]
Row index:  0  Unique Index:  0
['Toyota Corolla', 120.0, 'red']
Row index:  1  Unique Index:  1
['Bike', nan, 'blue']

ValueError: ['Bike', nan, 'blue'] is not in list

In [16]:
tidy_count(cars)

             name      hp color
0       Batmobile  1000.0   NaN
1  Toyota Corolla   120.0   red
2            Bike     NaN  blue
4       Batmobile   900.0   NaN
5            Bike     5.0  blue

ValueError: ['Bike', nan, 'blue'] is not in list

In [6]:
cleanlist

[['Batmobile', 1000.0, nan],
 ['Toyota Corolla', 120.0, 'red'],
 ['Bike', nan, 'blue'],
 ['Bike', nan, 'blue'],
 ['Batmobile', 900.0, nan],
 ['Bike', 5.0, 'blue'],
 ['Bike', nan, 'blue']]

In [71]:
cars.values.tolist()

[['Batmobile', 1000.0, nan],
 ['Toyota Corolla', 120.0, 'red'],
 ['Bike', nan, 'blue'],
 ['Bike', nan, 'blue'],
 ['Batmobile', 900.0, nan],
 ['Bike', 5.0, 'blue'],
 ['Bike', nan, 'blue']]

In [73]:
[list(x) for x in set(tuple(x) for x in cars.values.tolist())]

[('Bike', nan, 'blue'),
 ('Bike', nan, 'blue'),
 ('Batmobile', 1000.0, nan),
 ('Bike', nan, 'blue'),
 ('Batmobile', 900.0, nan),
 ('Bike', 5.0, 'blue'),
 ('Toyota Corolla', 120.0, 'red')]

In [79]:
f7(f7(cars.values.tolist()))

[('Batmobile', 1000.0, nan),
 ('Toyota Corolla', 120.0, 'red'),
 ('Bike', nan, 'blue'),
 ('Bike', nan, 'blue'),
 ('Batmobile', 900.0, nan),
 ('Bike', 5.0, 'blue'),
 ('Bike', nan, 'blue')]

In [51]:
k = cars.values.tolist()
k.sort()
list(k for k,_ in itertools.groupby(k))

[['Batmobile', 900.0, nan],
 ['Batmobile', 1000.0, nan],
 ['Bike', nan, 'blue'],
 ['Bike', nan, 'blue'],
 ['Bike', 5.0, 'blue'],
 ['Bike', nan, 'blue'],
 ['Toyota Corolla', 120.0, 'red']]

In [69]:
def f7(seq):
    seen = set()
    seen_add = seen.add
    return [tuple(x) for x in seq if not (tuple(x) in seen or seen_add(tuple(x)))]

In [70]:
f7([[1,2],
    [1],
    [1,2]])

[(1, 2), (1,)]

In [58]:
tuple([[1,2],
    [1],
    [1,2]])

([1, 2], [1], [1, 2])

In [52]:
tidy_count(cars)

             name      hp color
0            Bike     NaN  blue
1            Bike     NaN  blue
2       Batmobile  1000.0   NaN
3            Bike     NaN  blue
4       Batmobile   900.0   NaN
5            Bike     5.0  blue
6  Toyota Corolla   120.0   red

             name      hp color  count
0            Bike     NaN  blue      1
1            Bike     NaN  blue      1
2       Batmobile  1000.0   NaN      1
3            Bike     NaN  blue      1
4       Batmobile   900.0   NaN      1
5            Bike     5.0  blue      1
6  Toyota Corolla   120.0   red      1

In [22]:
tidy_count(df_combi,'a')

     a  count
1  1.0      4
0  NaN      1
2  NaN      1

In [23]:
tidy_count(df_combi,['a','c'])

     a      c  count
4  1.0   blah      2
0  NaN    NaN      1
1  NaN   blah      1
2  1.0  yadda      1
3  1.0    NaN      1

In [14]:
tidy_count(df_combi,['a','b','c'])

     a    b      c  count
3  1.0  1.0   blah      2
0  NaN  1.0   blah      1
1  1.0  2.0  yadda      1
2  1.0  NaN    NaN      1
4  NaN  NaN    NaN      1